/**
  ******************************************************************************
  * Copyright (c) 2018,北京中科浩电科技有限公司
  * All rights reserved.
  * 文件名称：board.h
  * 摘    要：
  *
  * 当前版本：V1.0
  * 作    者：北京中科浩电科技有限公司研发部 
  * 完成日期：    
  * 修改说明：
  * 
  *
  * 历史版本：
  *
  *
  *******************************************************************************/

#ifndef __BOARD_H__
#define __BOARD_H__

void System_Clock_Init(void);

#endif  // __BOARD_H__


/******************* (C) 版权所有 2018 北京中科浩电科技有限公司 *******************/


