#ifndef __DELAY_H_
#define __DELAY_H_

/**
  ******************************************************************************
  * Copyright (c) 2018,北京中科浩电科技有限公司
  * All rights reserved.
  * 文件名称：delay.h
  * 摘    要：
  *
  * 当前版本：V1.0
  * 作    者：北京中科浩电科技有限公司研发部 
  * 完成日期：    
  * 修改说明：
  * 
  *
  * 历史版本：
  *
  *
  *******************************************************************************/
#include "driverlib.h"



//Extern引用



//函数声明
void delay_ms(uint32_t ms);

/******************* (C) 版权所有 2018 北京中科浩电科技有限公司 *******************/
#endif 
