#include "driverlib.h"
#include "delay.h"

/******************************************************************************
  * 函数名称：delay_ms
  * 函数描述：ms级延时
  * 输    入：
  * uint32_t ms：延时ms
  * 输    出：void
  * 返    回：void
  * 备    注：null    
  *    
  *
******************************************************************************/
void delay_ms(uint32_t ms)
{
    for(int i=0;i<ms;i++)
    {
       __delay_cycles(24000);
    };
}

/******************* (C) 版权所有 2018 北京中科浩电科技有限公司 *******************/
